<html><body><pre class="autowrap">
<span style="font-family: monospace; font-size:medium;">Aufgabe 1

1. LRU ist schwierig umzusetzen, weil jeder Speicherzugriff daf&uuml;r beachtet werden muss und f&uuml;r den Prozess Hardwareunterst&uuml;tzung vorhanden sein muss, damit das ganze nicht viel zu langsam ist.
<span style="color:red;font-weight:bold;">Was ist teuer an dem &quot;beachten&quot; jedes Speicherzugriffes? (-1 P)
=&gt; Timestamps updaten (Rechenzeit)
=&gt; Timestamps speicher (Speicherplatz)
=&gt; Minimumsuche bei Seitenersetzung (Rechenzeit)</span>


2. Die FIFO-Anomalie tritt bei der FIFO-Ersetzungsstrategie auf und bezeichnet, dass bei mehr Speicherkacheln manchmal mehr Auslagerungen passieren als bei weniger.

3. Es m&uuml;ss keine andere Seite ausgelagert werden, um eine Seite einzulagern.
<span style="color:red;font-weight:bold;">Im Puffer k&ouml;nnen Kachen vorgehalten werden um sofort einlagern zu k&ouml;nnen.
Die Auslagerung kann sp&auml;ter zu einem g&uuml;nstigeren Zeitpunkt passieren. (-0.5 P)</span>

<span style="color:red;font-weight:bold;">1.5 P</span>

Aufgabe 2

Zuerst &uuml;bersetzt die MMU die logische Adresse in eine physikalische.
Dabei f&auml;llt auf, dass die Seite im Moment ausgelagert <span style="color:red;font-weight:bold;">(Pr&auml;senzbit ist 0)</span> ist und ein Page fault wird generiert.
Der Page fault wird vom Betriebssystem aufgefangen.
Das Betriebssystem schaut dann nach einer Kachel die ausgelagert werden kann.
Daf&uuml;r wandert der Zeiger so lange &uuml;ber die Kacheln und setzt das Referenzbit von 1 auf 0, bis eine Kachel mit einem Referenzbit von 0 gefunden wurde.
Der Inhalt dieser Kachel wird dann auf externen Speicher ausgelagert und die gebraucht Seite hineingeladen <span style="color:red;font-weight:bold;">(Pr&auml;senz und Referenzbit auf 1)</span>.
Dannach &uuml;bergibt das <span style="background-color:yellow;">Betriebssystem wieder die Kontrolle and den Prozess</span>, der jetzt auf den Speicher normal zugreifen kann.
<span style="color:red;font-weight:bold;">Das Fortf&uuml;hren des Prozesses an dem Befehl, welcher den PF ausgel&ouml;st hat, wird durch die Hardware realisiert (-0.5 P)</span>

<span style="color:red;font-weight:bold;">3.5 P</span>

Aufgabe 3


25ms = 25000ns <span style="color:red;font-weight:bold;">25ms = 25000000ns (-0.5 P)</span>
Zugriffszeit mit Seitenfehler: 25100ns <span style="color:red;font-weight:bold;">Wenn ein Seitenfehler auftritt, wird gar nicht auf die Seite zugegriffen.
Dann treten nur die 25ms &quot;Wartezeit&quot; auf. Wenn der Prozess dann sp&auml;ter wieder drann ist erfolgt ein normaler Zugriff
ohne Seitenfehler in 100ns. (-0.5 P)</span>

(p*100) + ((1-p)*25100) = 200
100p + 25100 - 25100p = 200
-25000p = -24900
p = 0,996

1-p = 0.004

Es d&uuml;rfen nur 0.4% der Speicherzugriffe Seitenfehler ausl&ouml;sen, damit die Zugriffszeit 200ns betr&auml;gt.

<span style="color:red;font-weight:bold;">1 P</span>

Aufgabe 4

1.
Rechenzeit:
2 * 6 Zeitscheiben * 30ms/Zeitscheibe = 360ms
<span style="color:red;font-weight:bold;">Es gibt nicht 2 * 6 Zeitscheiben, sondern 2 * 6 Seitenzugriffe. Ein erfolgreicher Seitenzugriff dauert dabei
10 ms und nicht 30 ms. Generell l&auml;sst sich das leider auch nicht so einfach rechnen. W&auml;hrend eine Seite geladen
wird, kann ein anderer Prozess rechnen oder auch eine Seite laden. =&gt; Tabelle wie in 2) aufstellen (-2 P)</span>

Falls die Prozesse keine Eingabe oder Ausgabe t&auml;tigen, ist die CPU-Auslastung bei 100%.
<span style="color:red;font-weight:bold;">Wie kommt ihr auf 100%? Das kann ja nur eintreten, wenn alle Seiten bereits geladen sind. Das ist jedoch nicht
der Fall und alleine deswegen m&uuml;ssen 6 PFs auftreten =&gt; nicht mehr 100% Auslastung
</span>

2.

Prozess     Zeit t/ms   Seintennr.  Kachel 1    Kachel 2    Hit/Pagefault   n&auml;chstes t  Rechenzeit
A           0           1           (1)         -           PF              20
B           0           11          (1)         (11)        PF              20
A           20          1           1           11          H               30          10
A           30          2           1           (2)         PF              50
B           30          11          (11)        (2)         PF              50
A           50          2           11          2           H               60          10
A           60          1           (1)         2           PF              80
B           60          11          (1)         (11)        PF              80
A           80          1           1           11          H               90          10
A           90          3           1           (3)         PF              <span style="background-color:yellow;">110</span>
B           90          11          (11)        (3)         PF              110
A           <span style="background-color:yellow;">120</span>         3           11          3           H               130         10 <span style="color:red;font-weight:bold;">A kann bereits bei t=110 laufen (-0.5 P)</span>
A           130         1           (1)         3           PF              150
B           130         11          (1)         (11)        PF              150
A           150         1           1           11          H               160         10
A           160         4           1           (4)         PF              180
B           160         11          (11)        (4)         PF              180
A           180         4           11          4           H               190         10
B           190         11          11          4           H               200         10
B           200         12          11          (12)        PF              220
B           220         12          11          12          H               230         10
B           230         11          11          12          H               240         10
B           240         12          11          12          H               250         10
B           250         11          11          12          H               260         10
B           260         12          11          12          H               270         10

Gesammtzeit: 260ms
Gesammt-CPU-Zeit: 120ms

(100/260ms)*120ms = 0.4615

Die mittlere CPU-Auslastung betr&auml;gt 46.15%

<span style="color:red;font-weight:bold;">
</span></span></pre>
<p>
	<span style="color:red;font-weight:bold;">6.5 P</span></p>
<p>
	&nbsp;</p>
<p>
	<span style="color:red;font-weight:bold;">MLD</span></p>
</body></html>