<html><body><pre class="autowrap">
<span style="font-family: monospace; font-size:medium;">
Aufgabe 1:

1.	du gibt alle Verzeichnisse (welche im Home Verzeichnis liegen) und deren Gr&ouml;&szlig;e an

	-m gibt die Gr&ouml;&szlig;e in MB an
	-d 1 gibt eine Tiefe von 1 an. Also nur Verzeichnisse der Tiefe 0 oder 1 werden beachtet


	sort -n sortiert den Standard Input numerisch

	-&gt; Zeigt der Gr&ouml;&szlig;e nach sortiert (klein zu gro&szlig;) alle Dirs im Home Verzeichnis in MB an und auch die Gr&ouml;&szlig;e vom Home Verzeichnis
<span style="color:red;font-weight:bold;">1P</span>

2. 	echo hallo &gt; ausgabe - schreibt hallo in die Datei ausgabe und &uuml;berschreibt das, was vorher dort drin war
	echo hi ho &gt; eingabe - schreibt hi ho in die Datei eingabe und &uuml;berschreibt das, was vorher dort drin war
	wc -w - Anzahl der W&ouml;rter
	wc -w &lt; eingabe - Datei eingabe wird &uuml;ber standard input in wc -w gegeben, gibt also 2 zur&uuml;ck
	wc -w &lt; eingabe &gt;&gt; ausgabe - output von &#39;wc -w &lt; eingabe&#39; wird an die Datei ausgabe angehangen


	Dannach ist der Inhalt von ausgabe:
	hallo
	2
<span style="color:red;font-weight:bold;">1P</span>

3. Mit -&gt; kann auf die Variablen in einer Struktur &uuml;ber einen Pointer zugegriffen werden. Mit . wird das gleiche direkt auf einer Struktur getan.
Es gilt:
a.b   =  (&amp;a)-&gt;b
a-&gt;b  =  (*a).b
<span style="color:red;font-weight:bold;">1P</span>

Aufgabe 2:

1. Der Code f&uuml;hrt fork in einer Endloschschleife aus.
<span style="color:red;font-weight:bold;">0.5P Was ist die Konsequenz daraus?</span>

2. In der ersten Generation gibt es einen Prozess, der fork ausf&uuml;hrt.
damit gibt es in der 2. Generation 2 Prozesse, die beide fork ausf&uuml;hren, dannach sind es 4 Prozesse.
In der 3. Generation hat man 4 Prozesse, die fork ausf&uuml;hren und hat dannach 8 Prozesse.

In der n-ten Generation gibt es 2^(n-1) Prozesse.
<span style="color:red;font-weight:bold;">2 P</span>



Aufgabe 3:

1.

Zust&auml;nde in ps:
D steht f&uuml;r nicht unterbrechbaren Schlaf.
S steht f&uuml;r unterbrechbaren Schlaf.
I steht f&uuml;r Programme in Leerlauf
T und t stehen f&uuml;r gestoppte Prozesse
X steht f&uuml;r Tote Prozesse, sollte es niemals geben, denn Tote Prozesse gibt es ja per Definition nicht mehr
Z steht f&uuml;r Zombie-Prozesse
<span style="color:red;font-weight:bold;">1P</span>
<span style="color:red;font-weight:bold;">Hier fehlt Running als Prozesszustand
MD
</span>
</span></pre></body></html>